# **Условие задачи:**

*Написать программу, которая из имеющегося массива из строк, длина которых меньше* 

*или равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на* 

*старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,*

*лучше обойтись исключительно массивами.*

## **Решение:**

### **Создать ввод массива:**

Console.WriteLine("Введите массив через запятую: ");
string text = Console.ReadLine();

### **Делим элементы массива:**

string[] existArray = text.Split(",");

### **Проверяем элементы массива на заданный размер и удовлетворяющие**
### **условию элементы записываем в новый массив:**

string[] newArray = existArray.Where(text=>text.Length<4).ToArray();

### **Вывод ответа:**

Console.WriteLine("Массив из строк, длина которых меньше либо равна 3:  ");
Console.WriteLine(String.Join(",", newArray));